burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_shrtimer.c
    switch (capturex)
    {
        /* read capture 0 value */
        case SHRTIMER_CAPTURE_0:
        {
          cap_val = SHRTIMER_STXCAP0V(shrtimer_periph, timer_id);
        }
        break;
        /* read capture 1 value */
        case SHRTIMER_CAPTURE_1:
        {
          cap_val = SHRTIMER_STXCAP1V(shrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
  
    return cap_val; 
}

/*!
    \brief      initialize ADC trigger configuration struct with a default value
    \param[in]  triggercfg: ADC trigger configuration struct
    \param[out] none
    \retval     none
*/
void shrtimer_adctrigcfg_struct_para_init(shrtimer_adctrigcfg_parameter_struct* triggercfg)
{
    triggercfg->trigger = SHRTIMER_ADCTRGI02_EVENT_NONE;
    triggercfg->update_source = SHRTIMER_ADCTRGI_UPDATE_MT;
}

/*!
    \brief      configure the trigger source to ADC and the update source
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  trigger_id: SHRTIMER_ADCTRIG_y(y=0..3)
    \param[in]  triggercfg: ADC trigger configuration struct
                  update_source: SHRTIMER_ADCTRGI_UPDATE_MT, SHRTIMER_ADCTRGI_UPDATE_STx(x=0..4)
                  trigger: 
                    for SHRTIMER_ADCTRIG0 and SHRTIMER_ADCTRIG2:
                           SHRTIMER_ADCTRGI02_EVENT_NONE, SHRTIMER_ADCTRGI02_EVENT_MTCMPy(y=0..3), 
                           SHRTIMER_ADCTRGI02_EVENT_MTPER, SHRTIMER_ADCTRGI02_EVENT_EXEVy(y=0..4), 
                           SHRTIMER_ADCTRGI02_EVENT_STxCMPy(x=0..4,y=1..3), 
                           SHRTIMER_ADCTRGI02_EVENT_STxPER(x=0..4), SHRTIMER_ADCTRGI02_EVENT_ST0xRST(x=0,1)
                    for SHRTIMER_ADCTRIG1 and SHRTIMER_ADCTRIG3:
                           SHRTIMER_ADCTRGI13_EVENT_NONE, SHRTIMER_ADCTRGI13_EVENT_MTCMPy(y=0..3), SHRTIMER_ADCTRGI13_EVENT_MTPER,
                           SHRTIMER_ADCTRGI13_EVENT_EXEVy(y=5..9),  SHRTIMER_ADCTRGI13_EVENT_STxCMPy(x=0..4, y=1..3),
                           SHRTIMER_ADCTRGI13_EVENT_STxPER(x=0..3), SHRTIMER_ADCTRGI13_EVENT_STxRST(x=2..4)
    \param[out] none
    \retval     none
*/
void shrtimer_adc_trigger_config(uint32_t shrtimer_periph, uint32_t trigger_id, shrtimer_adctrigcfg_parameter_struct* triggercfg)
{
    uint32_t comctl0_reg;
    
    comctl0_reg = SHRTIMER_CTL0(shrtimer_periph);
    switch (trigger_id)
    {
        /* configure the ADC trigger 0 */
        case SHRTIMER_ADCTRIG_0:
        {
            /* configure update source */
            comctl0_reg &= ~(SHRTIMER_CTL0_ADTG0USRC);
            comctl0_reg |= triggercfg->update_source;
          
            /* set the SHRTIMER_ADCTRIG0 source */
            SHRTIMER_ADCTRIGS0(shrtimer_periph) = triggercfg->trigger;
        }
        break;
        /* configure the ADC trigger 1 */
        case SHRTIMER_ADCTRIG_1:
        {
            /* configure update source */
            comctl0_reg &= ~(SHRTIMER_CTL0_ADTG1USRC);
            comctl0_reg |= ((triggercfg->update_source) << 3);
          
            /* set the SHRTIMER_ADCTRIG1 source */
            SHRTIMER_ADCTRIGS1(shrtimer_periph) = triggercfg->trigger;
        }
        break;
        /* configure the ADC trigger 2 */
        case SHRTIMER_ADCTRIG_2:
        {
            /* configure update source */
            comctl0_reg &= ~(SHRTIMER_CTL0_ADTG2USRC);
            comctl0_reg |= ((triggercfg->update_source) << 6);
          
            /* set the SHRTIMER_ADCTRIG2 source */
            SHRTIMER_ADCTRIGS2(shrtimer_periph) = triggercfg->trigger;
        }
        break;
        /* configure the ADC trigger 3 */
        case SHRTIMER_ADCTRIG_3:
        {
            /* configure update source */
            comctl0_reg &= ~(SHRTIMER_CTL0_ADTG3USRC);
            comctl0_reg |= ((triggercfg->update_source) << 9);
          
            /* set the SHRTIMER_ADCTRIG3 source */
            SHRTIMER_ADCTRIGS3(shrtimer_periph) = triggercfg->trigger;
        }
        break;
        default:
        break;
    }
    
    SHRTIMER_CTL0(shrtimer_periph) = comctl0_reg;
}

/*!
    \brief      get the Master_TIMER and Slave_TIMER flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_FLAG_CMP0: compare 0 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP1: compare 1 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP2: compare 2 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP3: compare 3 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_REP: repetition flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_FLAG_SYNI: synchronization input flag, for Master_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_UPD: update flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CAP0: capture 0 flag, for Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CAP1: capture 1 flag, for Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CH0OA: channel 0 output active flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH0ONA: channel 0 output inactive flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1OA: channel 1 output active flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1ONA: channel 1 output inactive flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CNTRST: counter reset flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_DLYIDLE: delayed IDLE mode entry flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CBLN: current balanced flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_BLNIDLE: balanced IDLE flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH0OUT: channel 0 output flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1OUT: channel 1 output flag, for Slave_TIMER 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus shrtimer_timers_flag_get(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t flag)
{
    FlagStatus flag_val = RESET;
    switch(timer_id)
    {
        /* get the Master_TIMER flag */
        case SHRTIMER_MASTER_TIMER:
            if(RESET != (SHRTIMER_MTINTF(shrtimer_periph) & flag)){
                flag_val = SET;
            }else{
                flag_val = RESET;
            }
        break;
        /* get the Slave_TIMER flag */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            if(RESET != (SHRTIMER_STXINTF(shrtimer_periph, timer_id) & flag)){
                flag_val = SET;
            }else{
                flag_val = RESET;
            }
        break;
        
        default:
        break;  
    }
    return flag_val;
}

/*!
    \brief      clear the Master_TIMER and Slave_TIMER flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_FLAG_CMP0: compare 0 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP1: compare 1 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP2: compare 2 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_CMP3: compare 3 flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_REP: repetition flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_FLAG_SYNI: synchronization input flag, for Master_TIMER
      \arg         SHRTIMER_MT_ST_FLAG_UPD: update flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CAP0: capture 0 flag, for Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CAP1: capture 1 flag, for Slave_TIMER
      \arg         SHRTIMER_ST_FLAG_CH0OA: channel 0 output active flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH0ONA: channel 0 output inactive flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1OA: channel 1 output active flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1ONA: channel 1 output inactive flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CNTRST: counter reset flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_DLYIDLE: delayed IDLE mode entry flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CBLN: current balanced flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_BLNIDLE: balanced IDLE flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH0OUT: channel 0 output flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_FLAG_CH1OUT: channel 1 output flag, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void shrtimer_timers_flag_clear(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t flag)
{
    switch(timer_id)
    {
        /* clear the Master_TIMER flag */
        case SHRTIMER_MASTER_TIMER:
            SHRTIMER_MTINTC(shrtimer_periph) |= flag;
        break;
        /* clear the Slave_TIMER flag */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            SHRTIMER_STXINTC(shrtimer_periph, timer_id) |= flag;
        break;
        default:
        break;  
    }
}

/*!
    \brief      get the common interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_FLAG_FLT0: fault 0 flag
      \arg         SHRTIMER_FLAG_FLT1: fault 1 flag
      \arg         SHRTIMER_FLAG_FLT2: fault 2 flag
      \arg         SHRTIMER_FLAG_FLT3: fault 3 flag
      \arg         SHRTIMER_FLAG_FLT4: fault 4 flag
      \arg         SHRTIMER_FLAG_SYSFLT: system fault flag
      \arg         SHRTIMER_FLAG_DLLCAL: DLL calibration completed flag
      \arg         SHRTIMER_FLAG_BMPER: bunch mode period flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus shrtimer_common_flag_get(uint32_t shrtimer_periph, uint32_t flag)
{
    /* judge interrupt status */
    if(RESET != (SHRTIMER_INTF(shrtimer_periph) & flag)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear the common interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_FLAG_FLT0: fault 0 flag
      \arg         SHRTIMER_FLAG_FLT1: fault 1 flag
      \arg         SHRTIMER_FLAG_FLT2: fault 2 flag
      \arg         SHRTIMER_FLAG_FLT3: fault 3 flag
      \arg         SHRTIMER_FLAG_FLT4: fault 4 flag
      \arg         SHRTIMER_FLAG_SYSFLT: system fault flag
      \arg         SHRTIMER_FLAG_DLLCAL: DLL calibration completed flag
      \arg         SHRTIMER_FLAG_BMPER: bunch mode period flag
    \param[out] none
    \retval     none
*/
void shrtimer_common_flag_clear(uint32_t shrtimer_periph, uint32_t flag)
{
    SHRTIMER_INTC(shrtimer_periph) |= flag;
}

/*!
    \brief      enable the Master_TIMER and Slave_TIMER interrupt 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_INT_CMP0: compare 0 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP1: compare 1 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP2: compare 2 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP3: compare 3 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_REP: repetition interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_INT_SYNI: synchronization input interrupt, for Master_TIMER
      \arg         SHRTIMER_MT_ST_INT_UPD: update interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_INT_CAP0: capture 0 interrupt, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_CAP1: capture 1 interrupt, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_CH0OA: channel 0 output active interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH0ONA: channel 0 output inactive interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH1OA: channel 1 output active interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH1ONA: channel 1 output inactive interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CNTRST: counter reset interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_DLYIDLE: delayed IDLE mode entry interrupt, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void shrtimer_timers_interrupt_enable(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* enable the Master_TIMER interrupt */
        case SHRTIMER_MASTER_TIMER:
            SHRTIMER_MTDMAINTEN(shrtimer_periph) |= interrupt;
        break;
        /* enable the Slave_TIMER interrupt */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            SHRTIMER_STXDMAINTEN(shrtimer_periph, timer_id) |= interrupt;
        break;
        
        default:
        break;  
    }
}
/*!
    \brief      disable the Master_TIMER and Slave_TIMER interrupt 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_INT_CMP0: compare 0 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP1: compare 1 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP2: compare 2 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_CMP3: compare 3 interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_REP: repetition interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_INT_SYNI: synchronization input interrupt, for Master_TIMER
      \arg         SHRTIMER_MT_ST_INT_UPD: update interrupt, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_INT_CAP0: capture 0 interrupt, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_CAP1: capture 1 interrupt, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_CH0OA: channel 0 output active interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH0ONA: channel 0 output inactive interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH1OA: channel 1 output active interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CH1ONA: channel 1 output inactive interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_CNTRST: counter reset interrupt, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_DLYIDLE: delayed IDLE mode entry interrupt, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void shrtimer_timers_interrupt_disable(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* disable the Master_TIMER interrupt */
        case SHRTIMER_MASTER_TIMER:
            SHRTIMER_MTDMAINTEN(shrtimer_periph) &= ~interrupt;
        break;
        /* disable the Slave_TIMER interrupt */
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
            SHRTIMER_STXDMAINTEN(shrtimer_periph, timer_id) &= ~interrupt;
        break;
    
        default:
        break;  
    }
}

/*!
    \brief      get the Master_TIMER and Slave_TIMER interrupt flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP0: compare 0 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP1: compare 1 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP2: compare 2 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_CMP3: compare 3 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_REP: repetition interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_MT_INT_FLAG_SYNI: synchronization input interrupt flag, for Master_TIMER
      \arg         SHRTIMER_MT_ST_INT_FLAG_UPD: update interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CAP0: capture 0 interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CAP1: capture 1 interrupt flag, for Slave_TIMER
      \arg         SHRTIMER_ST_INT_FLAG_CH0OA: channel 0 output active interrupt flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_FLAG_CH0ONA: channel 0 output inactive interrupt flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_FLAG_CH1OA: channel 1 output active interrupt flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_FLAG_CH1ONA: channel 1 output inactive interrupt flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_FLAG_CNTRST: counter reset interrupt flag, for Slave_TIMER 
      \arg         SHRTIMER_ST_INT_FLAG_DLYIDLE: delayed IDLE mode entry interrupt flag, for Slave_TIMER 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus shrtimer_timers_interrupt_flag_get(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    FlagStatus flag = RESET;
    uint32_t interflag = 0U;
    uint32_t interen = 0U;
    
