burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_shrtimer.c
    stxctl0_reg = SHRTIMER_STXCTL0(shrtimer_periph, slave_id);
    bmctl_reg = SHRTIMER_BMCTL(shrtimer_periph);
  
    /* configure the half mode */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_HALFM);
    stxctl0_reg |= slave_timerinit->half_mode;
  
    /* configure synchronization input start counter */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_SYNISTRT);
    stxctl0_reg |= slave_timerinit->start_sync;
 
    /* configure synchronization input reset counter */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_SYNIRST);
    stxctl0_reg |= slave_timerinit->reset_sync;
  
    /* configure trigger source to DAC */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_DACTRGS);
    stxctl0_reg |= slave_timerinit->dac_trigger;
  
    /* enable/disable shadow registers */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_SHWEN);
    stxctl0_reg |= slave_timerinit->shadow;
  
    /* update event selection */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_UPSEL);
    stxctl0_reg |= (slave_timerinit->update_selection);
  
    /* enable/disable registers update on repetition event */
    stxctl0_reg &= ~(uint32_t)(SHRTIMER_STXCTL0_UPREP);
    if(SHRTIMER_UPDATEONREPETITION_ENABLED == slave_timerinit->repetition_update){
        stxctl0_reg |= (SHRTIMER_STXCTL0_UPREP);
    }
    
    /* Set the timer bunch mode */
    switch (slave_id)
    {
        case SHRTIMER_SLAVE_TIMER0:
        {
            bmctl_reg &= ~(SHRTIMER_BMCTL_BMST0);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 1);
        }
        break;
        case SHRTIMER_SLAVE_TIMER1:
        {
            bmctl_reg &= ~(SHRTIMER_BMCTL_BMST1);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 2);
        }
        break;
        case SHRTIMER_SLAVE_TIMER2:
        {
            bmctl_reg &= ~(SHRTIMER_BMCTL_BMST2);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 3);
        }
        break;
        case SHRTIMER_SLAVE_TIMER3:
        {
            bmctl_reg &= ~(SHRTIMER_BMCTL_BMST3);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 4);
        }
        break;
        case SHRTIMER_SLAVE_TIMER4:
        {
            bmctl_reg &= ~(SHRTIMER_BMCTL_BMST4);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 5);
        }
        break;
        default:
        break;
    }

    SHRTIMER_STXCTL0(shrtimer_periph, slave_id) = stxctl0_reg;
    SHRTIMER_BMCTL(shrtimer_periph) = bmctl_reg;
}

/*!
    \brief      configure the an external event channel
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  event_id: SHRTIMER_EXEVENT_NONE, SHRTIMER_EXEVENT_y(y=0..9)
    \param[in]  eventcfg: external event configuration struct
                  source: SHRTIMER_EXEV_SRCy(y=0..3)
                  polarity: SHRTIMER_EXEV_POLARITY_HIGH, SHRTIMER_EXEV_POLARITY_LOW
                  edge: SHRTIMER_EXEV_EDGE_LEVEL, SHRTIMER_EXEV_EDGE_RISING, SHRTIMER_EXEV_EDGE_FALLING, SHRTIMER_EXEV_EDGE_BOTH
                  digital_filter: 0x0~0xF
    \param[out] none
    \retval     none
*/
static void external_event_config(uint32_t shrtimer_periph, uint32_t event_id, shrtimer_exeventcfg_parameter_struct* eventcfg)
{
    uint32_t exevcfg0_reg;
    uint32_t exevcfg1_reg;
    uint32_t exevdfctl_reg;

    exevcfg0_reg = SHRTIMER_EXEVCFG0(shrtimer_periph);
    exevcfg1_reg = SHRTIMER_EXEVCFG1(shrtimer_periph);
    exevdfctl_reg = SHRTIMER_EXEVDFCTL(shrtimer_periph);
  
    switch (event_id)
    {
        case SHRTIMER_EXEVENT_0:
        {
            /* configure external event 0 */
            exevcfg0_reg &= ~(SHRTIMER_EXEVCFG0_EXEV0SRC | SHRTIMER_EXEVCFG0_EXEV0P | SHRTIMER_EXEVCFG0_EXEV0EG);
            exevcfg0_reg |= eventcfg->source;
            exevcfg0_reg |= eventcfg->polarity;
            exevcfg0_reg |= eventcfg->edge;
            SHRTIMER_EXEVCFG0(shrtimer_periph) = exevcfg0_reg;
        }
        break;
        case SHRTIMER_EXEVENT_1:
        {
            /* configure external event 1 */
            exevcfg0_reg &= ~(SHRTIMER_EXEVCFG0_EXEV1SRC | SHRTIMER_EXEVCFG0_EXEV1P | SHRTIMER_EXEVCFG0_EXEV1EG);
            exevcfg0_reg |= ((eventcfg->source) << 6);
            exevcfg0_reg |= ((eventcfg->polarity) << 6);
            exevcfg0_reg |= ((eventcfg->edge) << 6);
            SHRTIMER_EXEVCFG0(shrtimer_periph) = exevcfg0_reg;
        }
        break;
        case SHRTIMER_EXEVENT_2:
        {
            /* configure external event 2 */
            exevcfg0_reg &= ~(SHRTIMER_EXEVCFG0_EXEV2SRC | SHRTIMER_EXEVCFG0_EXEV2P | SHRTIMER_EXEVCFG0_EXEV2EG);
            exevcfg0_reg |= ((eventcfg->source) << 12);
            exevcfg0_reg |= ((eventcfg->polarity) << 12);
            exevcfg0_reg |= ((eventcfg->edge) << 12);
            SHRTIMER_EXEVCFG0(shrtimer_periph) = exevcfg0_reg;
        }
        break;
        case SHRTIMER_EXEVENT_3:
        {
            /* configure external event 3 */
            exevcfg0_reg &= ~(SHRTIMER_EXEVCFG0_EXEV3SRC | SHRTIMER_EXEVCFG0_EXEV3P | SHRTIMER_EXEVCFG0_EXEV3EG);
            exevcfg0_reg |= ((eventcfg->source) << 18);
            exevcfg0_reg |= ((eventcfg->polarity) << 18);
            exevcfg0_reg |= ((eventcfg->edge) << 18);
            SHRTIMER_EXEVCFG0(shrtimer_periph) = exevcfg0_reg;
        }
        break;
        case SHRTIMER_EXEVENT_4:
        {
            /* configure external event 4 */
            exevcfg0_reg &= ~(SHRTIMER_EXEVCFG0_EXEV4SRC | SHRTIMER_EXEVCFG0_EXEV4P | SHRTIMER_EXEVCFG0_EXEV4EG);
            exevcfg0_reg |= ((eventcfg->source) << 24);
            exevcfg0_reg |= ((eventcfg->polarity) << 24);
            exevcfg0_reg |= ((eventcfg->edge) << 24);
            SHRTIMER_EXEVCFG0(shrtimer_periph) = exevcfg0_reg;
        }
        break;
        case SHRTIMER_EXEVENT_5:
        {
            /* configure external event 5 */
            exevcfg1_reg &= ~(SHRTIMER_EXEVCFG1_EXEV5SRC | SHRTIMER_EXEVCFG1_EXEV5P | SHRTIMER_EXEVCFG1_EXEV5EG);
            exevcfg1_reg |= (eventcfg->source);
            exevcfg1_reg |= (eventcfg->polarity);
            exevcfg1_reg |= (eventcfg->edge);
            exevdfctl_reg &= ~(SHRTIMER_EXEVDFCTL_EXEV5FC);
            exevdfctl_reg |= (eventcfg->digital_filter);
            SHRTIMER_EXEVCFG1(shrtimer_periph) = exevcfg1_reg;
            SHRTIMER_EXEVDFCTL(shrtimer_periph) = exevdfctl_reg;
        }
        break;
        case SHRTIMER_EXEVENT_6:
        {
            /* configure external event 6 */
            exevcfg1_reg &= ~(SHRTIMER_EXEVCFG1_EXEV6SRC | SHRTIMER_EXEVCFG1_EXEV6P | SHRTIMER_EXEVCFG1_EXEV6EG);
            exevcfg1_reg |= ((eventcfg->source) << 6);
            exevcfg1_reg |= ((eventcfg->polarity) << 6);
            exevcfg1_reg |= ((eventcfg->edge) << 6);
            exevdfctl_reg &= ~(SHRTIMER_EXEVDFCTL_EXEV6FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 6);
            SHRTIMER_EXEVCFG1(shrtimer_periph) = exevcfg1_reg;
            SHRTIMER_EXEVDFCTL(shrtimer_periph) = exevdfctl_reg;
        }
        break;
        case SHRTIMER_EXEVENT_7:
        {
            /* configure external event 7 */
            exevcfg1_reg &= ~(SHRTIMER_EXEVCFG1_EXEV7SRC | SHRTIMER_EXEVCFG1_EXEV7P | SHRTIMER_EXEVCFG1_EXEV7EG);
            exevcfg1_reg |= ((eventcfg->source) << 12);
            exevcfg1_reg |= ((eventcfg->polarity) << 12);
            exevcfg1_reg |= ((eventcfg->edge) << 12);
            exevdfctl_reg &= ~(SHRTIMER_EXEVDFCTL_EXEV7FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 12);
            SHRTIMER_EXEVCFG1(shrtimer_periph) = exevcfg1_reg;
            SHRTIMER_EXEVDFCTL(shrtimer_periph) = exevdfctl_reg;
        }
        break;
        case SHRTIMER_EXEVENT_8:
        {
            /* configure external event 8 */
            exevcfg1_reg &= ~(SHRTIMER_EXEVCFG1_EXEV8SRC | SHRTIMER_EXEVCFG1_EXEV8P | SHRTIMER_EXEVCFG1_EXEV8EG);
            exevcfg1_reg |= ((eventcfg->source) << 18);
            exevcfg1_reg |= ((eventcfg->polarity) << 18);
            exevcfg1_reg |= ((eventcfg->edge) << 18);
            exevdfctl_reg &= ~(SHRTIMER_EXEVDFCTL_EXEV8FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 18);
            SHRTIMER_EXEVCFG1(shrtimer_periph) = exevcfg1_reg;
            SHRTIMER_EXEVDFCTL(shrtimer_periph) = exevdfctl_reg;
        }
        break;
        case SHRTIMER_EXEVENT_9:
        {
            /* configure external event 9 */
            exevcfg1_reg &= ~(SHRTIMER_EXEVCFG1_EXEV9SRC | SHRTIMER_EXEVCFG1_EXEV9P | SHRTIMER_EXEVCFG1_EXEV9EG);
            exevcfg1_reg |= ((eventcfg->source) << 24);
            exevcfg1_reg |= ((eventcfg->polarity) << 24);
            exevcfg1_reg |= ((eventcfg->edge) << 24);
            exevdfctl_reg &= ~(SHRTIMER_EXEVDFCTL_EXEV9FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 24);
            SHRTIMER_EXEVCFG1(shrtimer_periph) = exevcfg1_reg;
            SHRTIMER_EXEVDFCTL(shrtimer_periph) = exevdfctl_reg;
        }
        break;
        default:
        break;
    }
}


/*!
    \brief      configure the channel output 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  channel: SHRTIMER_STx_CHy(x=0..4,y=0,1)
    \param[in]  outcfg: channel output configuration struct definitions
                  polarity: SHRTIMER_CHANNEL_POLARITY_HIGH, SHRTIMER_CHANNEL_POLARITY_LOW
                  set_request: SHRTIMER_CHANNEL_SET_NONE, SHRTIMER_CHANNEL_SET_RSTSYNI, SHRTIMER_CHANNEL_SET_PER, SHRTIMER_CHANNEL_SET_CMPy(y=0..3),
                               SHRTIMER_CHANNEL_SET_MTPER, SHRTIMER_CHANNEL_SET_MTCMPy(y=0..3), SHRTIMER_CHANNEL_SET_STEVy(y=0..8),
                               SHRTIMER_CHANNEL_SET_EXEVy(y=0..9), SHRTIMER_CHANNEL_SET_UPDATE
                  reset_request: SHRTIMER_CHANNEL_RESET_NONE, SHRTIMER_CHANNEL_RESET_RSTSYNI, SHRTIMER_CHANNEL_RESET_PER, SHRTIMER_CHANNEL_RESET_CMPy(y=0..3),
                               SHRTIMER_CHANNEL_RESET_MTPER, SHRTIMER_CHANNEL_RESET_MTCMPy(y=0..3), SHRTIMER_CHANNEL_RESET_STEVy(y=0..8),
                               SHRTIMER_CHANNEL_RESET_EXEVy(y=0..9), SHRTIMER_CHANNEL_RESET_UPDATE
                  idle_bunch: SHRTIMER_CHANNEL_BUNCH_IDLE_DISABLE, SHRTIMER_CHANNEL_BUNCH_IDLE_ENABLE
                  idle_state: SHRTIMER_CHANNEL_IDLESTATE_INACTIVE, SHRTIMER_CHANNEL_IDLESTATE_ACTIVE
                  fault_state: SHRTIMER_CHANNEL_FAULTSTATE_NONE, SHRTIMER_CHANNEL_FAULTSTATE_ACTIVE, SHRTIMER_CHANNEL_FAULTSTATE_INACTIVE, SHRTIMER_CHANNEL_FAULTSTATE_HIGHZ
                  carrier_mode: SHRTIMER_CHANNEL_CARRIER_DISABLED, SHRTIMER_CHANNEL_CARRIER_ENABLED
                  deadtime_bunch: SHRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR, SHRTIMER_CHANNEL_BUNCH_ENTRY_DEADTIME
    \param[out] none
    \retval     none
*/
static void channel_output_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t channel, shrtimer_channel_outputcfg_parameter_struct * outcfg)
{
    uint32_t stxchoctl_reg;
    uint32_t shift = 0U;
  
    stxchoctl_reg = SHRTIMER_STXCHOCTL(shrtimer_periph, timer_id);
    /* configure the output set/reset crossbar */
    switch (channel)
    {
        case SHRTIMER_ST0_CH0:
        case SHRTIMER_ST1_CH0:
        case SHRTIMER_ST2_CH0:
        case SHRTIMER_ST3_CH0:
        case SHRTIMER_ST4_CH0:
        {
            shift = 0U;
            SHRTIMER_STXCH0SET(shrtimer_periph, timer_id) = outcfg->set_request;
            SHRTIMER_STXCH0RST(shrtimer_periph, timer_id) = outcfg->reset_request;
        }
        break;
        case SHRTIMER_ST0_CH1:
        case SHRTIMER_ST1_CH1:
        case SHRTIMER_ST2_CH1:
        case SHRTIMER_ST3_CH1:
        case SHRTIMER_ST4_CH1:
        {
            shift = 16U;
            SHRTIMER_STXCH1SET(shrtimer_periph, timer_id) = outcfg->set_request;
            SHRTIMER_STXCH1RST(shrtimer_periph, timer_id) = outcfg->reset_request;
        }
        break;
        default:
        break;
    }
  
    /* clear output config */
    stxchoctl_reg &= ~((SHRTIMER_STXCHOCTL_CH0P | SHRTIMER_STXCHOCTL_BMCH0IEN | SHRTIMER_STXCHOCTL_ISO0 | SHRTIMER_STXCHOCTL_CH0FLTOS|\
                     SHRTIMER_STXCHOCTL_CH0CSEN | SHRTIMER_STXCHOCTL_BMCH0DTI)  << shift);
    
    /* config the polarity */
    stxchoctl_reg |= (outcfg->polarity << shift);
  
    /* channel IDLE enable state config in bunch mode */
    stxchoctl_reg |= (outcfg->idle_bunch << shift);
    
    /* config channel output IDLE state */
    stxchoctl_reg |= (outcfg->idle_state << shift);
    
    /* config the FAULT output state */
    stxchoctl_reg |= (outcfg->fault_state << shift);
    
    /* config the channel carrier-signal mode enable state */
    stxchoctl_reg |= (outcfg->carrier_mode << shift);

    /* config channel dead-time insert in bunch mode */
    stxchoctl_reg |= (outcfg->deadtime_bunch << shift);
  
    SHRTIMER_STXCHOCTL(shrtimer_periph, timer_id) = stxchoctl_reg;
}

#endif /* GD32EPRT */
